# Используем базовый образ Ubuntu с последними обновлениями
FROM ubuntu:latest

# Обновляем пакеты и устанавливаем необходимые зависимости:
# - x11-apps: набор графических утилит для тестирования X11
# - xauth: для управления аутентификацией X11
# - openjdk-11-jre: для запуска Java-приложений
# После установки очищаем кеш apt, чтобы уменьшить размер образа
RUN apt-get update && apt-get install -y \
    x11-apps \
    xauth \
    openjdk-11-jre \
    && rm -rf /var/lib/apt/lists/*

# Устанавливаем переменную окружения DISPLAY
# Это необходимо для отображения графических приложений через X-сервер хоста
ENV DISPLAY=host.docker.internal:0

# Копируем Java-приложение (calc.jar) в контейнер
# Файл calc.jar должен находиться в той же директории, где расположен Dockerfile
COPY calc.jar /app/calc.jar

# Устанавливаем рабочую директорию в /app
WORKDIR /app

# Указываем команду по умолчанию для запуска контейнера
# В данном случае запускается графическое приложение xeyes
CMD ["java", "-jar", "calc.jar"]
